# HiddenLineViews Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..HiddenLineViews Property
PrintParameters Class See Also
---
The hidden line views type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public HiddenLineViewsType HiddenLineViews { get; set; }
```

Visual Basic
---
```text
Public Property HiddenLineViews As HiddenLineViewsType
	Get
	Set
```

Visual C++
---
```text
public:
property HiddenLineViewsType HiddenLineViews {
	HiddenLineViewsType get ();
	void set (HiddenLineViewsType value);
}
```

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace